#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_subnet.public_subnet_a: Refreshing state... [id=subnet-081111dbb9db6661f]
aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=num-mgmt-prod-eks-node-group-2025081005490821070000000d]
aws_route_table_association.public_rt_a: Refreshing state... [id=rtbassoc-0e3a0977f2ae3d9b9]
aws_iam_role_policy_attachment.AmazonEKSServicePolicy: Refreshing state... [id=num-mgmt-prod-eks-cluster-role-2025081005490822880000000e]
aws_iam_role_policy.sm_policy: Refreshing state... [id=num-mgmt-prod-eks-node-group:SecretsManager_readaccess]
aws_security_group_rule.node_inbound_node: Refreshing state... [id=sgrule-1032294380]
aws_iam_openid_connect_provider.default[0]: Refreshing state... [id=arn:aws:iam::992382441132:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/F3676C777A80F8BCB373CC6E5EA0C3BE]
aws_route_table_association.private_rt_a: Refreshing state... [id=rtbassoc-03aa0dc3e14d0cfd2]
aws_iam_role.ec2_role: Refreshing state... [id=ec2-eks-ssm-s3-fullaccess-role]
aws_security_group.ec2_sg: Refreshing state... [id=sg-08174a940d31cd9fc]
aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=num-mgmt-prod-eks-node-group-2025081005490816790000000b]
aws_security_group.eks_node: Refreshing state... [id=sg-07feb1532b5399ea0]
aws_route_table_association.private_rt_b: Refreshing state... [id=rtbassoc-01d04bfc705bc16b1]
aws_security_group_rule.node_inbound_webhooks: Refreshing state... [id=sgrule-3228027420]
aws_nat_gateway.nat: Refreshing state... [id=nat-046571b836929ec16]
aws_security_group_rule.node_outbound_internet: Refreshing state... [id=sgrule-533721454]
aws_iam_role_policy_attachment.ssm: Refreshing state... [id=ec2-eks-ssm-s3-fullaccess-role-20250810054907983400000002]
aws_route_table_association.public_rt_b: Refreshing state... [id=rtbassoc-0208e290fc4311bd6]
aws_eks_cluster.aws_eks: Refreshing state... [id=mgmt-eks-cluster]
aws_security_group_rule.node_inbound_node_extension: Refreshing state... [id=sgrule-192312478]
aws_iam_role_policy_attachment.eks: Refreshing state... [id=ec2-eks-ssm-s3-fullaccess-role-20250810054908042000000005]
aws_iam_role_policy_attachment.AmazonSSMFullAccess: Refreshing state... [id=num-mgmt-prod-eks-node-group-2025081005490816560000000a]
aws_iam_instance_profile.ec2_profile: Refreshing state... [id=ec2-eks-ssm-profile]
aws_iam_role_policy_attachment.AmazonSQSFullAccess: Refreshing state... [id=num-mgmt-prod-eks-cluster-role-2025081005490824080000000f]
aws_vpc.vpc: Refreshing state... [id=vpc-0dccce2def3e421c1]
aws_subnet.public_subnet_b: Refreshing state... [id=subnet-0b4c8efc990bb9b1f]
aws_subnet.private_subnet_a: Refreshing state... [id=subnet-0a72ac9c2aeb1965f]
aws_iam_role_policy_attachment.eks_service: Refreshing state... [id=ec2-eks-ssm-s3-fullaccess-role-20250810054908039700000004]
aws_eks_node_group.node: Refreshing state... [id=mgmt-eks-cluster:num-mgmt-prod-node]
aws_security_group_rule.cluster_outbound_node: Refreshing state... [id=sgrule-1048970231]
aws_iam_role_policy_attachment.s3_full: Refreshing state... [id=ec2-eks-ssm-s3-fullaccess-role-20250810054908018200000003]
aws_subnet.private_subnet_b: Refreshing state... [id=subnet-08c714e253cccc4d1]
aws_iam_role.eks_nodes: Refreshing state... [id=num-mgmt-prod-eks-node-group]
aws_iam_role_policy_attachment.AmazonS3FullAccess: Refreshing state... [id=num-mgmt-prod-eks-node-group-20250810054908051700000007]
aws_security_group_rule.cluster_outbound: Refreshing state... [id=sgrule-2951571548]
aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=num-mgmt-prod-eks-cluster-role-20250810054908148100000009]
aws_security_group_rule.cluster_inbound_subnet: Refreshing state... [id=sgrule-3343027942]
aws_security_group_rule.cluster_inbound: Refreshing state... [id=sgrule-4216858635]
aws_instance.ec2_instance: Refreshing state... [id=i-0111f5339bfe59c07]
aws_launch_template.eks_launch_template: Refreshing state... [id=lt-08b74f835019894c0]
aws_iam_role_policy_attachment.ec2_full: Refreshing state... [id=ec2-eks-ssm-s3-fullaccess-role-20250810054908050600000006]
aws_eks_addon.kube-proxy: Refreshing state... [id=mgmt-eks-cluster:kube-proxy]
aws_security_group_rule.node_inbound_master: Refreshing state... [id=sgrule-4062072762]
aws_security_group_rule.node_outbound_node: Refreshing state... [id=sgrule-3992475341]
aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=num-mgmt-prod-eks-node-group-20250810054908142800000008]
aws_iam_role_policy_attachment.AmazonSQSFull-Access: Refreshing state... [id=num-mgmt-prod-eks-node-group-2025081005490820020000000c]
aws_iam_role.eks_cluster: Refreshing state... [id=num-mgmt-prod-eks-cluster-role]
aws_internet_gateway.igw: Refreshing state... [id=igw-0dbe72316e94e12c8]
aws_security_group_rule.node_outbound_master: Refreshing state... [id=sgrule-1291749790]
aws_eks_addon.vpc-cni: Refreshing state... [id=mgmt-eks-cluster:vpc-cni]
aws_route_table.public_route_table: Refreshing state... [id=rtb-074e9e38d017fadcd]
data.aws_caller_identity.current: Reading...
data.aws_ami.amazon_linux: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=992382441132]
aws_security_group.eks_cluster: Refreshing state... [id=sg-045ba040e4cb7e4b7]
aws_eip.nat: Refreshing state... [id=eipalloc-0947d78f71064e666]
aws_eks_addon.coredns: Refreshing state... [id=mgmt-eks-cluster:coredns]
aws_route_table.private: Refreshing state... [id=rtb-0bcfb2d0bb3529d68]
data.aws_ami.amazon_linux: Read complete after 0s [id=ami-0e2c86481225d3c51]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.tls_certificate.eks will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "eks" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # aws_ecr_repository.app_repo will be created
  + resource "aws_ecr_repository" "app_repo" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "my-eks-cluster-app"
      + region               = "us-east-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name" = "my-eks-cluster-ecr-repo"
        }
      + tags_all             = {
          + "Name" = "my-eks-cluster-ecr-repo"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_eip.nat will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-0947d78f71064e666"
      ~ tags                 = {
          ~ "Name" = "eks-nat-eip" -> "my-eks-cluster-nat-eip"
        }
      ~ tags_all             = {
          ~ "Name" = "eks-nat-eip" -> "my-eks-cluster-nat-eip"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_eks_addon.coredns must be replaced
-/+ resource "aws_eks_addon" "coredns" {
      ~ addon_version               = "v1.11.4-eksbuild.10" -> "v1.11.1-eksbuild.8"
      ~ arn                         = "arn:aws:eks:us-east-1:992382441132:addon/mgmt-eks-cluster/coredns/58cc4947-d9be-96a0-854d-08d894ec4ed6" -> (known after apply)
      ~ cluster_name                = "mgmt-eks-cluster" -> "my-eks-cluster" # forces replacement
      + configuration_values        = (known after apply)
      ~ created_at                  = "2025-08-10T05:59:08Z" -> (known after apply)
      ~ id                          = "mgmt-eks-cluster:coredns" -> (known after apply)
      ~ modified_at                 = "2025-08-10T06:14:26Z" -> (known after apply)
      - resolve_conflicts_on_create = "OVERWRITE" -> null
      ~ tags                        = {
          + "Name" = "my-eks-cluster-coredns"
        }
      ~ tags_all                    = {
          + "Name" = "my-eks-cluster-coredns"
        }
        # (2 unchanged attributes hidden)
    }

  # aws_eks_addon.ebs_csi will be created
  + resource "aws_eks_addon" "ebs_csi" {
      + addon_name           = "aws-ebs-csi-driver"
      + addon_version        = "v1.35.0-eksbuild.1"
      + arn                  = (known after apply)
      + cluster_name         = "my-eks-cluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + region               = "us-east-1"
      + tags_all             = (known after apply)
    }

  # aws_eks_addon.kube-proxy will be destroyed
  # (because aws_eks_addon.kube-proxy is not in configuration)
  - resource "aws_eks_addon" "kube-proxy" {
      - addon_name                  = "kube-proxy" -> null
      - addon_version               = "v1.32.3-eksbuild.7" -> null
      - arn                         = "arn:aws:eks:us-east-1:992382441132:addon/mgmt-eks-cluster/kube-proxy/e4cc4947-d9c0-0bee-4cce-a5fe62c6605f" -> null
      - cluster_name                = "mgmt-eks-cluster" -> null
      - created_at                  = "2025-08-10T05:59:08Z" -> null
      - id                          = "mgmt-eks-cluster:kube-proxy" -> null
      - modified_at                 = "2025-08-10T06:01:58Z" -> null
      - region                      = "us-east-1" -> null
      - resolve_conflicts_on_create = "OVERWRITE" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
    }

  # aws_eks_addon.kube_proxy will be created
  + resource "aws_eks_addon" "kube_proxy" {
      + addon_name           = "kube-proxy"
      + addon_version        = "v1.31.0-eksbuild.5"
      + arn                  = (known after apply)
      + cluster_name         = "my-eks-cluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + region               = "us-east-1"
      + tags                 = {
          + "Name" = "my-eks-cluster-kube-proxy"
        }
      + tags_all             = {
          + "Name" = "my-eks-cluster-kube-proxy"
        }
    }

  # aws_eks_addon.vpc-cni will be destroyed
  # (because aws_eks_addon.vpc-cni is not in configuration)
  - resource "aws_eks_addon" "vpc-cni" {
      - addon_name                  = "vpc-cni" -> null
      - addon_version               = "v1.19.5-eksbuild.1" -> null
      - arn                         = "arn:aws:eks:us-east-1:992382441132:addon/mgmt-eks-cluster/vpc-cni/3acc4947-d9c3-1f16-4aba-79f45d2b716a" -> null
      - cluster_name                = "mgmt-eks-cluster" -> null
      - created_at                  = "2025-08-10T05:59:08Z" -> null
      - id                          = "mgmt-eks-cluster:vpc-cni" -> null
      - modified_at                 = "2025-08-10T06:01:59Z" -> null
      - region                      = "us-east-1" -> null
      - resolve_conflicts_on_create = "OVERWRITE" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
    }

  # aws_eks_addon.vpc_cni will be created
  + resource "aws_eks_addon" "vpc_cni" {
      + addon_name           = "vpc-cni"
      + addon_version        = "v1.18.1-eksbuild.3"
      + arn                  = (known after apply)
      + cluster_name         = "my-eks-cluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + region               = "us-east-1"
      + tags                 = {
          + "Name" = "my-eks-cluster-vpc-cni"
        }
      + tags_all             = {
          + "Name" = "my-eks-cluster-vpc-cni"
        }
    }

  # aws_eks_cluster.aws_eks will be destroyed
  # (because aws_eks_cluster.aws_eks is not in configuration)
  - resource "aws_eks_cluster" "aws_eks" {
      - arn                           = "arn:aws:eks:us-east-1:992382441132:cluster/mgmt-eks-cluster" -> null
      - bootstrap_self_managed_addons = true -> null
      - certificate_authority         = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJR3VrWDBrVFJaNGt3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TlRBNE1UQXdOVFE1TVRWYUZ3MHpOVEE0TURnd05UVTBNVFZhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUURNczEyMVlEMzVmVWNTR2VvZG5vaXlSbUpuUlZ6ZTdlSDFTUkJuZ2FMUzBWVU16bEpIRjFRMEFPTzUKdzZOWFVVMG1OOFREUUFiM2JXcmZSa0Z2WlVhV2hvQVMyUzFLQkNoVlJGcEN1MWFUYzQ5dnFLeXp6SzZKN0R1TwozaVhXZmRJTEg3MWsxK2tER21IN1FTVXZFNnFDajBXT3N0cDJ6Um5rUnBMU0FaVDZQRU91bmUrTE9ma3ZSMWdvCkhnVXdLMk1yZk5xaG9Pak9HN2RyUGVJTlJYaE94L3YvRGtzTXF0ZStVbFNIS09Ya3lUV3lpdE4vdGNNUkwzaVoKd1JGOGNzTHZleFEvdzdFOFdCQWMxdFczdEV4MjVmSnNzMFNYcFZENDZIamt4SEY5SXR1VG9TL1BLUDJaMUxjZAoxK0pBczVSZzl6aWR0eTNRemxLOWxuZXhSUWRUQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJURVc0NklERzUzOVFPQkp3UStDL1h1TmRVa3REQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQ2UvY2svVVNySgpPVUFCcm5LTktDKzJyNG5yc3I1amNhaGZKeUE2QWkzZDZPdUlId29zemRqMm5kWXdreTJhTUpUakx0NFZmQUVjCnp5cDlnS2hMQ2R0bC9wTVAvRGVmWmc2RWowaU0weEt1ekpkbWhEMzdGK3p3SlJvWkM1b2ExUThGOWV2ZWcyWE4KU0VJSnhrcG9saXY0QUFNRnVlb20zRmNNZklxenpGTXpPcnh5bVc3MkhRZWdydjRmSFdaenpJY2gzeERRNGI1MQpRbzB4TVI3Q1FlRUpYK0dNc29GLzlmZFpPVlQ1VGNmd2ZDU3U0QTZ1T0Uzak1pVjIrZ2x1QXV6bnNtZjh4RnV6Ck9sdzdPZGVYcGYxRWNhak5lL0tlelhSQWpHb0t4NnVLUUd1OU1vd1RtaFpNamtsUVlldFN3NkFlQWhVUkdSckwKNGZNakhrYzRWWGl0Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> null
      - created_at                    = "2025-08-10T05:49:25Z" -> null
      - enabled_cluster_log_types     = [
          - "audit",
        ] -> null
      - endpoint                      = "https://F3676C777A80F8BCB373CC6E5EA0C3BE.gr7.us-east-1.eks.amazonaws.com" -> null
      - id                            = "mgmt-eks-cluster" -> null
      - identity                      = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-east-1.amazonaws.com/id/F3676C777A80F8BCB373CC6E5EA0C3BE"
                    },
                ]
            },
        ] -> null
      - name                          = "mgmt-eks-cluster" -> null
      - platform_version              = "eks.16" -> null
      - region                        = "us-east-1" -> null
      - role_arn                      = "arn:aws:iam::992382441132:role/num-mgmt-prod-eks-cluster-role" -> null
      - status                        = "ACTIVE" -> null
      - tags                          = {
          - "Name" = "mgmt-eks-cluster"
        } -> null
      - tags_all                      = {
          - "Name" = "mgmt-eks-cluster"
        } -> null
      - version                       = "1.32" -> null

      - access_config {
          - authentication_mode                         = "CONFIG_MAP" -> null
          - bootstrap_cluster_creator_admin_permissions = true -> null
        }

      - kubernetes_network_config {
          - ip_family         = "ipv4" -> null
          - service_ipv4_cidr = "172.20.0.0/16" -> null

          - elastic_load_balancing {
              - enabled = false -> null
            }
        }

      - upgrade_policy {
          - support_type = "EXTENDED" -> null
        }

      - vpc_config {
          - cluster_security_group_id = "sg-026639fc353963edd" -> null
          - endpoint_private_access   = true -> null
          - endpoint_public_access    = false -> null
          - public_access_cidrs       = [] -> null
          - security_group_ids        = [
              - "sg-045ba040e4cb7e4b7",
            ] -> null
          - subnet_ids                = [
              - "subnet-08c714e253cccc4d1",
              - "subnet-0a72ac9c2aeb1965f",
            ] -> null
          - vpc_id                    = "vpc-0dccce2def3e421c1" -> null
        }
    }

  # aws_eks_cluster.main will be created
  + resource "aws_eks_cluster" "main" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "my-eks-cluster"
      + platform_version              = (known after apply)
      + region                        = "us-east-1"
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "Name" = "my-eks-cluster"
        }
      + tags_all                      = {
          + "Name" = "my-eks-cluster"
        }
      + version                       = "1.31"

      + access_config {
          + authentication_mode                         = (known after apply)
          + bootstrap_cluster_creator_admin_permissions = (known after apply)
        }

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)

          + elastic_load_balancing {
              + enabled = (known after apply)
            }
        }

      + upgrade_policy {
          + support_type = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.main will be created
  + resource "aws_eks_node_group" "main" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "my-eks-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "my-eks-cluster-nodes"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + region                 = "us-east-1"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Name" = "my-eks-cluster-node-group"
        }
      + tags_all               = {
          + "Name" = "my-eks-cluster-node-group"
        }
      + version                = (known after apply)

      + node_repair_config {
          + enabled = (known after apply)
        }

      + scaling_config {
          + desired_size = 2
          + max_size     = 4
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_eks_node_group.node will be destroyed
  # (because aws_eks_node_group.node is not in configuration)
  - resource "aws_eks_node_group" "node" {
      - ami_type        = "CUSTOM" -> null
      - arn             = "arn:aws:eks:us-east-1:992382441132:nodegroup/mgmt-eks-cluster/num-mgmt-prod-node/5ccc4951-b122-5d51-a722-02aeb9e657de" -> null
      - capacity_type   = "ON_DEMAND" -> null
      - cluster_name    = "mgmt-eks-cluster" -> null
      - disk_size       = 0 -> null
      - id              = "mgmt-eks-cluster:num-mgmt-prod-node" -> null
      - instance_types  = [
          - "t3.medium",
        ] -> null
      - labels          = {} -> null
      - node_group_name = "num-mgmt-prod-node" -> null
      - node_role_arn   = "arn:aws:iam::992382441132:role/num-mgmt-prod-eks-node-group" -> null
      - region          = "us-east-1" -> null
      - release_version = "ami-02e60ceca69eedf91" -> null
      - resources       = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-num-mgmt-prod-node-5ccc4951-b122-5d51-a722-02aeb9e657de"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> null
      - status          = "CREATE_FAILED" -> null
      - subnet_ids      = [
          - "subnet-08c714e253cccc4d1",
          - "subnet-0a72ac9c2aeb1965f",
        ] -> null
      - tags            = {
          - "Name" = "mgmt-eks-node"
        } -> null
      - tags_all        = {
          - "Name" = "mgmt-eks-node"
        } -> null

      - launch_template {
          - id      = "lt-08b74f835019894c0" -> null
          - name    = "prod_eks_launch_template" -> null
          - version = "1" -> null
        }

      - scaling_config {
          - desired_size = 2 -> null
          - max_size     = 3 -> null
          - min_size     = 1 -> null
        }

      - update_config {
          - max_unavailable            = 1 -> null
          - max_unavailable_percentage = 0 -> null
        }
    }

  # aws_iam_instance_profile.bastion_profile will be created
  + resource "aws_iam_instance_profile" "bastion_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "my-eks-cluster-bastion-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "my-eks-cluster-bastion-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_instance_profile.ec2_profile will be destroyed
  # (because aws_iam_instance_profile.ec2_profile is not in configuration)
  - resource "aws_iam_instance_profile" "ec2_profile" {
      - arn         = "arn:aws:iam::992382441132:instance-profile/ec2-eks-ssm-profile" -> null
      - create_date = "2025-08-10T05:49:07Z" -> null
      - id          = "ec2-eks-ssm-profile" -> null
      - name        = "ec2-eks-ssm-profile" -> null
      - path        = "/" -> null
      - role        = "ec2-eks-ssm-s3-fullaccess-role" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
      - unique_id   = "AIPA6ODU2K2WIRCLPSKQS" -> null
    }

  # aws_iam_openid_connect_provider.default[0] will be destroyed
  # (because aws_iam_openid_connect_provider.default is not in configuration)
  - resource "aws_iam_openid_connect_provider" "default" {
      - arn             = "arn:aws:iam::992382441132:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/F3676C777A80F8BCB373CC6E5EA0C3BE" -> null
      - client_id_list  = [
          - "sts.amazonaws.com",
        ] -> null
      - id              = "arn:aws:iam::992382441132:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/F3676C777A80F8BCB373CC6E5EA0C3BE" -> null
      - tags            = {} -> null
      - tags_all        = {} -> null
      - thumbprint_list = [
          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] -> null
      - url             = "oidc.eks.us-east-1.amazonaws.com/id/F3676C777A80F8BCB373CC6E5EA0C3BE" -> null
    }

  # aws_iam_openid_connect_provider.eks will be created
  + resource "aws_iam_openid_connect_provider" "eks" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Name" = "my-eks-cluster-oidc-provider"
        }
      + tags_all        = {
          + "Name" = "my-eks-cluster-oidc-provider"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # aws_iam_role.bastion_role will be created
  + resource "aws_iam_role" "bastion_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "my-eks-cluster-bastion-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "my-eks-cluster-bastion-role"
        }
      + tags_all              = {
          + "Name" = "my-eks-cluster-bastion-role"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.ec2_role will be destroyed
  # (because aws_iam_role.ec2_role is not in configuration)
  - resource "aws_iam_role" "ec2_role" {
      - arn                   = "arn:aws:iam::992382441132:role/ec2-eks-ssm-s3-fullaccess-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-08-10T05:49:07Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ec2-eks-ssm-s3-fullaccess-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEC2FullAccess",
          - "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
          - "arn:aws:iam::aws:policy/AmazonEKSServicePolicy",
          - "arn:aws:iam::aws:policy/AmazonS3FullAccess",
          - "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ec2-eks-ssm-s3-fullaccess-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA6ODU2K2WI7CEZ4QOR" -> null
    }

  # aws_iam_role.eks_cluster will be destroyed
  # (because aws_iam_role.eks_cluster is not in configuration)
  - resource "aws_iam_role" "eks_cluster" {
      - arn                   = "arn:aws:iam::992382441132:role/num-mgmt-prod-eks-cluster-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "eks.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-08-10T05:49:07Z" -> null
      - force_detach_policies = false -> null
      - id                    = "num-mgmt-prod-eks-cluster-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
          - "arn:aws:iam::aws:policy/AmazonEKSServicePolicy",
          - "arn:aws:iam::aws:policy/AmazonSQSFullAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "num-mgmt-prod-eks-cluster-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA6ODU2K2WKQVG7R5OW" -> null
    }

  # aws_iam_role.eks_cluster_role will be created
  + resource "aws_iam_role" "eks_cluster_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "my-eks-cluster-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "my-eks-cluster-cluster-role"
        }
      + tags_all              = {
          + "Name" = "my-eks-cluster-cluster-role"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.eks_node_group_role will be created
  + resource "aws_iam_role" "eks_node_group_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "my-eks-cluster-node-group-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "my-eks-cluster-node-group-role"
        }
      + tags_all              = {
          + "Name" = "my-eks-cluster-node-group-role"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.eks_nodes will be destroyed
  # (because aws_iam_role.eks_nodes is not in configuration)
  - resource "aws_iam_role" "eks_nodes" {
      - arn                   = "arn:aws:iam::992382441132:role/num-mgmt-prod-eks-node-group" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-08-10T05:49:07Z" -> null
      - force_detach_policies = false -> null
      - id                    = "num-mgmt-prod-eks-node-group" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly",
          - "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy",
          - "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
          - "arn:aws:iam::aws:policy/AmazonS3FullAccess",
          - "arn:aws:iam::aws:policy/AmazonSQSFullAccess",
          - "arn:aws:iam::aws:policy/AmazonSSMFullAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "num-mgmt-prod-eks-node-group" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA6ODU2K2WBABUCRAE5" -> null

      - inline_policy {
          - name   = "SecretsManager_readaccess" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "secretsmanager:GetRandomPassword",
                              - "secretsmanager:GetResourcePolicy",
                              - "secretsmanager:GetSecretValue",
                              - "secretsmanager:DescribeSecret",
                              - "secretsmanager:ListSecretVersionIds",
                              - "secretsmanager:ListSecrets",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role_policy.sm_policy will be destroyed
  # (because aws_iam_role_policy.sm_policy is not in configuration)
  - resource "aws_iam_role_policy" "sm_policy" {
      - id     = "num-mgmt-prod-eks-node-group:SecretsManager_readaccess" -> null
      - name   = "SecretsManager_readaccess" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "secretsmanager:GetRandomPassword",
                          - "secretsmanager:GetResourcePolicy",
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:DescribeSecret",
                          - "secretsmanager:ListSecretVersionIds",
                          - "secretsmanager:ListSecrets",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "num-mgmt-prod-eks-node-group" -> null
    }

  # aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly will be destroyed
  # (because aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly is not in configuration)
  - resource "aws_iam_role_policy_attachment" "AmazonEC2ContainerRegistryReadOnly" {
      - id         = "num-mgmt-prod-eks-node-group-2025081005490821070000000d" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly" -> null
      - role       = "num-mgmt-prod-eks-node-group" -> null
    }

  # aws_iam_role_policy_attachment.AmazonEKSClusterPolicy will be destroyed
  # (because aws_iam_role_policy_attachment.AmazonEKSClusterPolicy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "AmazonEKSClusterPolicy" {
      - id         = "num-mgmt-prod-eks-cluster-role-20250810054908148100000009" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy" -> null
      - role       = "num-mgmt-prod-eks-cluster-role" -> null
    }

  # aws_iam_role_policy_attachment.AmazonEKSServicePolicy will be destroyed
  # (because aws_iam_role_policy_attachment.AmazonEKSServicePolicy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "AmazonEKSServicePolicy" {
      - id         = "num-mgmt-prod-eks-cluster-role-2025081005490822880000000e" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy" -> null
      - role       = "num-mgmt-prod-eks-cluster-role" -> null
    }

  # aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy will be destroyed
  # (because aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "AmazonEKSWorkerNodePolicy" {
      - id         = "num-mgmt-prod-eks-node-group-2025081005490816790000000b" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy" -> null
      - role       = "num-mgmt-prod-eks-node-group" -> null
    }

  # aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy will be destroyed
  # (because aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "AmazonEKS_CNI_Policy" {
      - id         = "num-mgmt-prod-eks-node-group-20250810054908142800000008" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy" -> null
      - role       = "num-mgmt-prod-eks-node-group" -> null
    }

  # aws_iam_role_policy_attachment.AmazonS3FullAccess will be destroyed
  # (because aws_iam_role_policy_attachment.AmazonS3FullAccess is not in configuration)
  - resource "aws_iam_role_policy_attachment" "AmazonS3FullAccess" {
      - id         = "num-mgmt-prod-eks-node-group-20250810054908051700000007" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonS3FullAccess" -> null
      - role       = "num-mgmt-prod-eks-node-group" -> null
    }

  # aws_iam_role_policy_attachment.AmazonSQSFull-Access will be destroyed
  # (because aws_iam_role_policy_attachment.AmazonSQSFull-Access is not in configuration)
  - resource "aws_iam_role_policy_attachment" "AmazonSQSFull-Access" {
      - id         = "num-mgmt-prod-eks-node-group-2025081005490820020000000c" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonSQSFullAccess" -> null
      - role       = "num-mgmt-prod-eks-node-group" -> null
    }

  # aws_iam_role_policy_attachment.AmazonSQSFullAccess will be destroyed
  # (because aws_iam_role_policy_attachment.AmazonSQSFullAccess is not in configuration)
  - resource "aws_iam_role_policy_attachment" "AmazonSQSFullAccess" {
      - id         = "num-mgmt-prod-eks-cluster-role-2025081005490824080000000f" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonSQSFullAccess" -> null
      - role       = "num-mgmt-prod-eks-cluster-role" -> null
    }

  # aws_iam_role_policy_attachment.AmazonSSMFullAccess will be destroyed
  # (because aws_iam_role_policy_attachment.AmazonSSMFullAccess is not in configuration)
  - resource "aws_iam_role_policy_attachment" "AmazonSSMFullAccess" {
      - id         = "num-mgmt-prod-eks-node-group-2025081005490816560000000a" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonSSMFullAccess" -> null
      - role       = "num-mgmt-prod-eks-node-group" -> null
    }

  # aws_iam_role_policy_attachment.bastion_ecr_policy will be created
  + resource "aws_iam_role_policy_attachment" "bastion_ecr_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryFullAccess"
      + role       = "my-eks-cluster-bastion-role"
    }

  # aws_iam_role_policy_attachment.bastion_eks_policy will be created
  + resource "aws_iam_role_policy_attachment" "bastion_eks_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "my-eks-cluster-bastion-role"
    }

  # aws_iam_role_policy_attachment.bastion_ssm_policy will be created
  + resource "aws_iam_role_policy_attachment" "bastion_ssm_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "my-eks-cluster-bastion-role"
    }

  # aws_iam_role_policy_attachment.ec2_full will be destroyed
  # (because aws_iam_role_policy_attachment.ec2_full is not in configuration)
  - resource "aws_iam_role_policy_attachment" "ec2_full" {
      - id         = "ec2-eks-ssm-s3-fullaccess-role-20250810054908050600000006" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEC2FullAccess" -> null
      - role       = "ec2-eks-ssm-s3-fullaccess-role" -> null
    }

  # aws_iam_role_policy_attachment.eks will be destroyed
  # (because aws_iam_role_policy_attachment.eks is not in configuration)
  - resource "aws_iam_role_policy_attachment" "eks" {
      - id         = "ec2-eks-ssm-s3-fullaccess-role-20250810054908042000000005" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy" -> null
      - role       = "ec2-eks-ssm-s3-fullaccess-role" -> null
    }

  # aws_iam_role_policy_attachment.eks_cluster_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_cluster_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "my-eks-cluster-cluster-role"
    }

  # aws_iam_role_policy_attachment.eks_cni_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_cni_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "my-eks-cluster-node-group-role"
    }

  # aws_iam_role_policy_attachment.eks_container_registry_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_container_registry_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "my-eks-cluster-node-group-role"
    }

  # aws_iam_role_policy_attachment.eks_service will be destroyed
  # (because aws_iam_role_policy_attachment.eks_service is not in configuration)
  - resource "aws_iam_role_policy_attachment" "eks_service" {
      - id         = "ec2-eks-ssm-s3-fullaccess-role-20250810054908039700000004" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy" -> null
      - role       = "ec2-eks-ssm-s3-fullaccess-role" -> null
    }

  # aws_iam_role_policy_attachment.eks_ssm_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_ssm_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "my-eks-cluster-node-group-role"
    }

  # aws_iam_role_policy_attachment.eks_worker_node_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_worker_node_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "my-eks-cluster-node-group-role"
    }

  # aws_iam_role_policy_attachment.s3_full will be destroyed
  # (because aws_iam_role_policy_attachment.s3_full is not in configuration)
  - resource "aws_iam_role_policy_attachment" "s3_full" {
      - id         = "ec2-eks-ssm-s3-fullaccess-role-20250810054908018200000003" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonS3FullAccess" -> null
      - role       = "ec2-eks-ssm-s3-fullaccess-role" -> null
    }

  # aws_iam_role_policy_attachment.ssm will be destroyed
  # (because aws_iam_role_policy_attachment.ssm is not in configuration)
  - resource "aws_iam_role_policy_attachment" "ssm" {
      - id         = "ec2-eks-ssm-s3-fullaccess-role-20250810054907983400000002" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore" -> null
      - role       = "ec2-eks-ssm-s3-fullaccess-role" -> null
    }

  # aws_instance.bastion will be created
  + resource "aws_instance" "bastion" {
      + ami                                  = "ami-0e2c86481225d3c51"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + force_destroy                        = false
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "my-eks-cluster-bastion-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "us-east-1"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "my-eks-cluster-bastion"
        }
      + tags_all                             = {
          + "Name" = "my-eks-cluster-bastion"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "IyEvYmluL2Jhc2gKCiMgVXBkYXRlIHRoZSBzeXN0ZW0KeXVtIHVwZGF0ZSAteQoKIyBJbnN0YWxsIHJlcXVpcmVkIHBhY2thZ2VzCnl1bSBpbnN0YWxsIC15IGN1cmwgd2dldCBnaXQgdW56aXAKCgojIEluc3RhbGwga3ViZWN0bApjdXJsIC1MTyAiaHR0cHM6Ly9kbC5rOHMuaW8vcmVsZWFzZS8kKGN1cmwgLUwgLXMgaHR0cHM6Ly9kbC5rOHMuaW8vcmVsZWFzZS9zdGFibGUudHh0KS9iaW4vbGludXgvYW1kNjQva3ViZWN0bCIKaW5zdGFsbCAtbyByb290IC1nIHJvb3QgLW0gMDc1NSBrdWJlY3RsIC91c3IvbG9jYWwvYmluL2t1YmVjdGwKCiMgSW5zdGFsbCBla3NjdGwKY3VybCAtLXNpbGVudCAtLWxvY2F0aW9uICJodHRwczovL2dpdGh1Yi5jb20vd2VhdmV3b3Jrcy9la3NjdGwvcmVsZWFzZXMvbGF0ZXN0L2Rvd25sb2FkL2Vrc2N0bF8kKHVuYW1lIC1zKV9hbWQ2NC50YXIuZ3oiIHwgdGFyIHh6IC1DIC90bXAKbXYgL3RtcC9la3NjdGwgL3Vzci9sb2NhbC9iaW4KCiMgSW5zdGFsbCBIZWxtCmN1cmwgLWZzU0wgLW8gZ2V0X2hlbG0uc2ggaHR0cHM6Ly9yYXcuZ2l0aHVidXNlcmNvbnRlbnQuY29tL2hlbG0vaGVsbS9tYWluL3NjcmlwdHMvZ2V0LWhlbG0tMwpjaG1vZCA3MDAgZ2V0X2hlbG0uc2gKLi9nZXRfaGVsbS5zaAoKIyBJbnN0YWxsIERvY2tlciAoZm9yIGJ1aWxkaW5nIGltYWdlcykKeXVtIGluc3RhbGwgLXkgZG9ja2VyCnN5c3RlbWN0bCBzdGFydCBkb2NrZXIKc3lzdGVtY3RsIGVuYWJsZSBkb2NrZXIKdXNlcm1vZCAtYSAtRyBkb2NrZXIgZWMyLXVzZXIKCiMgQ29uZmlndXJlIGt1YmVjdGwgZm9yIHRoZSBFS1MgY2x1c3Rlcgpta2RpciAtcCAvaG9tZS9lYzItdXNlci8ua3ViZQphd3MgZWtzIHVwZGF0ZS1rdWJlY29uZmlnIC0tcmVnaW9uIHVzLWVhc3QtMSAtLW5hbWUgbXktZWtzLWNsdXN0ZXIgLS1rdWJlY29uZmlnIC9ob21lL2VjMi11c2VyLy5rdWJlL2NvbmZpZwpjaG93biAtUiBlYzItdXNlcjplYzItdXNlciAvaG9tZS9lYzItdXNlci8ua3ViZQoKIyBDcmVhdGUgaGVscGZ1bCBzY3JpcHRzIGZvciBlYzItdXNlcgpjYXQgPDwgJ0VPRicgPiAvaG9tZS9lYzItdXNlci91cGRhdGUta3ViZWNvbmZpZy5zaAojIS9iaW4vYmFzaAphd3MgZWtzIHVwZGF0ZS1rdWJlY29uZmlnIC0tcmVnaW9uIHVzLWVhc3QtMSAtLW5hbWUgbXktZWtzLWNsdXN0ZXIKZWNobyAiS3ViZWNvbmZpZyB1cGRhdGVkIGZvciBjbHVzdGVyOiBteS1la3MtY2x1c3RlciIKRU9GCgpjYXQgPDwgJ0VPRicgPiAvaG9tZS9lYzItdXNlci9nZXQtY2x1c3Rlci1pbmZvLnNoCiMhL2Jpbi9iYXNoCmVjaG8gIj09PSBFS1MgQ2x1c3RlciBJbmZvID09PSIKa3ViZWN0bCBjbHVzdGVyLWluZm8KZWNobyAiIgplY2hvICI9PT0gTm9kZXMgPT09IgprdWJlY3RsIGdldCBub2RlcwplY2hvICIiCmVjaG8gIj09PSBQb2RzIGluIGFsbCBuYW1lc3BhY2VzID09PSIKa3ViZWN0bCBnZXQgcG9kcyAtLWFsbC1uYW1lc3BhY2VzCkVPRgoKY2htb2QgK3ggL2hvbWUvZWMyLXVzZXIvKi5zaApjaG93biBlYzItdXNlcjplYzItdXNlciAvaG9tZS9lYzItdXNlci8qLnNoCgojIENyZWF0ZSBhIHdlbGNvbWUgbWVzc2FnZQpjYXQgPDwgJ0VPRicgPiAvaG9tZS9lYzItdXNlci9SRUFETUUudHh0CldlbGNvbWUgdG8gdGhlIEVLUyBCYXN0aW9uIEhvc3QhCgpUaGlzIGluc3RhbmNlIGlzIGNvbmZpZ3VyZWQgd2l0aDoKLSBBV1MgQ0xJIHYyCi0ga3ViZWN0bAotIGVrc2N0bAotIGhlbG0KLSBkb2NrZXIKCkF2YWlsYWJsZSBzY3JpcHRzOgotIC4vdXBkYXRlLWt1YmVjb25maWcuc2ggLSBVcGRhdGVzIGt1YmVjdGwgY29uZmlndXJhdGlvbiBmb3IgdGhlIEVLUyBjbHVzdGVyCi0gLi9nZXQtY2x1c3Rlci1pbmZvLnNoIC0gU2hvd3MgY2x1c3RlciBpbmZvcm1hdGlvbiBhbmQgcnVubmluZyBwb2RzCgpUaGUga3ViZWNvbmZpZyBpcyBhbHJlYWR5IGNvbmZpZ3VyZWQgZm9yIGNsdXN0ZXI6IG15LWVrcy1jbHVzdGVyCgpUbyBnZXQgc3RhcnRlZDoKMS4gVGVzdCBjbHVzdGVyIGFjY2Vzczoga3ViZWN0bCBnZXQgbm9kZXMKMi4gVmlldyBwb2RzOiBrdWJlY3RsIGdldCBwb2RzIC0tYWxsLW5hbWVzcGFjZXMKMy4gQWNjZXNzIHZpYSBTU006IGF3cyBzc20gc3RhcnQtc2Vzc2lvbiAtLXRhcmdldCAkKGN1cmwgLXMgaHR0cDovLzE2OS4yNTQuMTY5LjI1NC9sYXRlc3QvbWV0YS1kYXRhL2luc3RhbmNlLWlkKQpFT0YKCmNob3duIGVjMi11c2VyOmVjMi11c2VyIC9ob21lL2VjMi11c2VyL1JFQURNRS50eHQKCiMgSW5zdGFsbCBTU00gYWdlbnQgKHNob3VsZCBhbHJlYWR5IGJlIGluc3RhbGxlZCBvbiBBbWF6b24gTGludXggMikKeXVtIGluc3RhbGwgLXkgYW1hem9uLXNzbS1hZ2VudApzeXN0ZW1jdGwgc3RhcnQgYW1hem9uLXNzbS1hZ2VudApzeXN0ZW1jdGwgZW5hYmxlIGFtYXpvbi1zc20tYWdlbnQKCmVjaG8gIkJhc3Rpb24gaG9zdCBzZXR1cCBjb21wbGV0ZWQgc3VjY2Vzc2Z1bGx5ISI="
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.ec2_instance will be destroyed
  # (because aws_instance.ec2_instance is not in configuration)
  - resource "aws_instance" "ec2_instance" {
      - ami                                  = "ami-0e2c86481225d3c51" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:992382441132:instance/i-0111f5339bfe59c07" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "us-east-1a" -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - iam_instance_profile                 = "ec2-eks-ssm-profile" -> null
      - id                                   = "i-0111f5339bfe59c07" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t3.medium" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-06926d602311d29bc" -> null
      - private_dns                          = "ip-10-20-3-142.ec2.internal" -> null
      - private_ip                           = "10.20.3.142" -> null
      - public_dns                           = "ec2-44-200-67-157.compute-1.amazonaws.com" -> null
      - public_ip                            = "44.200.67.157" -> null
      - region                               = "us-east-1" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-081111dbb9db6661f" -> null
      - tags                                 = {
          - "Name" = "ec2-eks-ssm-s3-ec2-fullaccess"
        } -> null
      - tags_all                             = {
          - "Name" = "ec2-eks-ssm-s3-ec2-fullaccess"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = <<-EOT
            #!/bin/bash
            set -e
            
            # Update packages
            yum update -y
            
            # Install dependencies
            yum install -y curl unzip tar aws-cli jq git
            
            # Install kubectl (latest stable)
            curl -LO "https://storage.googleapis.com/kubernetes-release/release/$(curl -s https://storage.googleapis.com/kubernetes-release/release/stable.txt)/bin/linux/amd64/kubectl"
            chmod +x ./kubectl
            mv ./kubectl /usr/local/bin/kubectl
            
            # Install eksctl (latest release)
            curl --silent --location "https://github.com/weaveworks/eksctl/releases/latest/download/eksctl_$(uname -s)_amd64.tar.gz" | tar xz -C /tmp
            mv /tmp/eksctl /usr/local/bin
            chmod +x /usr/local/bin/eksctl
            
            # Confirm installations
            kubectl version --client || true
            eksctl version || true
            
                          
        EOT -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-08174a940d31cd9fc",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0ac042dad982993f0" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_internet_gateway.igw will be destroyed
  # (because aws_internet_gateway.igw is not in configuration)
  - resource "aws_internet_gateway" "igw" {
      - arn      = "arn:aws:ec2:us-east-1:992382441132:internet-gateway/igw-0dbe72316e94e12c8" -> null
      - id       = "igw-0dbe72316e94e12c8" -> null
      - owner_id = "992382441132" -> null
      - region   = "us-east-1" -> null
      - tags     = {
          - "Name" = "eks-internet-gateway"
        } -> null
      - tags_all = {
          - "Name" = "eks-internet-gateway"
        } -> null
      - vpc_id   = "vpc-0dccce2def3e421c1" -> null
    }

  # aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "us-east-1"
      + tags     = {
          + "Name" = "my-eks-cluster-igw"
        }
      + tags_all = {
          + "Name" = "my-eks-cluster-igw"
        }
      + vpc_id   = (known after apply)
    }

  # aws_launch_template.eks_launch_template will be destroyed
  # (because aws_launch_template.eks_launch_template is not in configuration)
  - resource "aws_launch_template" "eks_launch_template" {
      - arn                     = "arn:aws:ec2:us-east-1:992382441132:launch-template/lt-08b74f835019894c0" -> null
      - default_version         = 1 -> null
      - disable_api_stop        = false -> null
      - disable_api_termination = false -> null
      - id                      = "lt-08b74f835019894c0" -> null
      - image_id                = "ami-02e60ceca69eedf91" -> null
      - latest_version          = 1 -> null
      - name                    = "prod_eks_launch_template" -> null
      - region                  = "us-east-1" -> null
      - security_group_names    = [] -> null
      - tags                    = {} -> null
      - tags_all                = {} -> null
      - user_data               = "IyEvYmluL2Jhc2gKL2V0Yy9la3MvYm9vdHN0cmFwLnNoIC0tYXBpc2VydmVyLWVuZHBvaW50IGh0dHBzOi8vRjM2NzZDNzc3QTgwRjhCQ0IzNzNDQzZFNUVBMEMzQkUuZ3I3LnVzLWVhc3QtMS5la3MuYW1hem9uYXdzLmNvbSAtLWI2NC1jbHVzdGVyLWNhIExTMHRMUzFDUlVkSlRpQkRSVkpVU1VaSlEwRlVSUzB0TFMwdENrMUpTVVJDVkVORFFXVXlaMEYzU1VKQlowbEpSM1ZyV0RCclZGSmFOR3QzUkZGWlNrdHZXa2xvZG1OT1FWRkZURUpSUVhkR1ZFVlVUVUpGUjBFeFZVVUtRWGhOUzJFelZtbGFXRXAxV2xoU2JHTjZRV1ZHZHpCNVRsUkJORTFVUVhkT1ZGRTFUVlJXWVVaM01IcE9WRUUwVFVSbmQwNVVWVEJOVkZaaFRVSlZlQXBGZWtGU1FtZE9Wa0pCVFZSRGJYUXhXVzFXZVdKdFZqQmFXRTEzWjJkRmFVMUJNRWREVTNGSFUwbGlNMFJSUlVKQlVWVkJRVFJKUWtSM1FYZG5aMFZMQ2tGdlNVSkJVVVJOY3pFeU1WbEVNelZtVldOVFIyVnZaRzV2YVhsU2JVcHVVbFo2WlRkbFNERlRVa0p1WjJGTVV6QldWVTE2YkVwSVJqRlJNRUZQVHpVS2R6Wk9XRlZWTUcxT09GUkVVVUZpTTJKWGNtWlNhMFoyV2xWaFYyaHZRVk15VXpGTFFrTm9WbEpHY0VOMU1XRlVZelE1ZG5GTGVYcDZTelpLTjBSMVR3b3phVmhYWm1SSlRFZzNNV3N4SzJ0RVIyMUlOMUZUVlhaRk5uRkRhakJYVDNOMGNESjZVbTVyVW5CTVUwRmFWRFpRUlU5MWJtVXJURTltYTNaU01XZHZDa2huVlhkTE1rMXlaazV4YUc5UGFrOUhOMlJ5VUdWSlRsSllhRTk0TDNZdlJHdHpUWEYwWlN0VmJGTklTMDlZYTNsVVYzbHBkRTR2ZEdOTlVrd3phVm9LZDFKR09HTnpUSFpsZUZFdmR6ZEZPRmRDUVdNeGRGY3pkRVY0TWpWbVNuTnpNRk5ZY0ZaRU5EWklhbXQ0U0VZNVNYUjFWRzlUTDFCTFVESmFNVXhqWkFveEswcEJjelZTWnpsNmFXUjBlVE5SZW14TE9XeHVaWGhTVVdSVVFXZE5Ra0ZCUjJwWFZFSllUVUUwUjBFeFZXUkVkMFZDTDNkUlJVRjNTVU53UkVGUUNrSm5UbFpJVWsxQ1FXWTRSVUpVUVVSQlVVZ3ZUVUl3UjBFeFZXUkVaMUZYUWtKVVJWYzBOa2xFUnpVek9WRlBRa3AzVVN0REwxaDFUbVJWYTNSRVFWWUtRbWRPVmtoU1JVVkVha0ZOWjJkd2NtUlhTbXhqYlRWc1pFZFdlazFCTUVkRFUzRkhVMGxpTTBSUlJVSkRkMVZCUVRSSlFrRlJRMlV2WTJzdlZWTnlTZ3BQVlVGQ2NtNUxUa3RES3pKeU5HNXljM0kxYW1OaGFHWktlVUUyUVdrelpEWlBkVWxJZDI5emVtUnFNbTVrV1hkcmVUSmhUVXBVYWt4ME5GWm1RVVZqQ25wNWNEbG5TMmhNUTJSMGJDOXdUVkF2UkdWbVdtYzJSV293YVUwd2VFdDFla3BrYldoRU16ZEdLM3AzU2xKdldrTTFiMkV4VVRoR09XVjJaV2N5V0U0S1UwVkpTbmhyY0c5c2FYWTBRVUZOUm5WbGIyMHpSbU5OWmtseGVucEdUWHBQY25oNWJWYzNNa2hSWldkeWRqUm1TRmRhZW5wSlkyZ3plRVJSTkdJMU1RcFJiekI0VFZJM1ExRmxSVXBZSzBkTmMyOUdMemxtWkZwUFZsUTFWR05tZDJaRFUzVTBRVFoxVDBVemFrMXBWaklyWjJ4MVFYVjZibk50WmpoNFJuVjZDazlzZHpkUFpHVlljR1l4UldOaGFrNWxMMHRsZWxoU1FXcEhiMHQ0Tm5WTFVVZDFPVTF2ZDFSdGFGcE5hbXRzVVZsbGRGTjNOa0ZsUVdoVlVrZFNja3dLTkdaTmFraHJZelJXV0dsMENpMHRMUzB0UlU1RUlFTkZVbFJKUmtsRFFWUkZMUzB0TFMwSyBtZ210LWVrcy1jbHVzdGVyCnl1bSAteSB1cGRhdGUgLS1zZWN1cml0eQ==" -> null
      - vpc_security_group_ids  = [] -> null

      - block_device_mappings {
          - device_name = "/dev/xvda" -> null

          - ebs {
              - iops                       = 0 -> null
              - throughput                 = 0 -> null
              - volume_initialization_rate = 0 -> null
              - volume_size                = 30 -> null
              - volume_type                = "gp3" -> null
            }
        }

      - tag_specifications {
          - resource_type = "instance" -> null
          - tags          = {
              - "CreatedBy" = "Terraform"
            } -> null
        }
    }

  # aws_nat_gateway.main will be created
  + resource "aws_nat_gateway" "main" {
      + allocation_id                      = "eipalloc-0947d78f71064e666"
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + region                             = "us-east-1"
      + secondary_allocation_ids           = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "my-eks-cluster-nat-gateway"
        }
      + tags_all                           = {
          + "Name" = "my-eks-cluster-nat-gateway"
        }
    }

  # aws_nat_gateway.nat will be destroyed
  # (because aws_nat_gateway.nat is not in configuration)
  - resource "aws_nat_gateway" "nat" {
      - allocation_id                      = "eipalloc-0947d78f71064e666" -> null
      - association_id                     = "eipassoc-0ff0d3888730bba9f" -> null
      - connectivity_type                  = "public" -> null
      - id                                 = "nat-046571b836929ec16" -> null
      - network_interface_id               = "eni-02476716b4d0ff0da" -> null
      - private_ip                         = "10.20.3.203" -> null
      - public_ip                          = "52.55.119.175" -> null
      - region                             = "us-east-1" -> null
      - secondary_allocation_ids           = [] -> null
      - secondary_private_ip_address_count = 0 -> null
      - secondary_private_ip_addresses     = [] -> null
      - subnet_id                          = "subnet-081111dbb9db6661f" -> null
      - tags                               = {
          - "Name" = "eks-nat-gateway"
        } -> null
      - tags_all                           = {
          - "Name" = "eks-nat-gateway"
        } -> null
    }

  # aws_route_table.private must be replaced
-/+ resource "aws_route_table" "private" {
      ~ arn              = "arn:aws:ec2:us-east-1:992382441132:route-table/rtb-0bcfb2d0bb3529d68" -> (known after apply)
      ~ id               = "rtb-0bcfb2d0bb3529d68" -> (known after apply)
      ~ owner_id         = "992382441132" -> (known after apply)
      ~ propagating_vgws = [] -> (known after apply)
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-046571b836929ec16"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
            # (1 unchanged element hidden)
        ]
      ~ tags             = {
          ~ "Name" = "eks-private-route-table" -> "my-eks-cluster-private-rt"
        }
      ~ tags_all         = {
          ~ "Name" = "eks-private-route-table" -> "my-eks-cluster-private-rt"
        }
      ~ vpc_id           = "vpc-0dccce2def3e421c1" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "my-eks-cluster-public-rt"
        }
      + tags_all         = {
          + "Name" = "my-eks-cluster-public-rt"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public_route_table will be destroyed
  # (because aws_route_table.public_route_table is not in configuration)
  - resource "aws_route_table" "public_route_table" {
      - arn              = "arn:aws:ec2:us-east-1:992382441132:route-table/rtb-074e9e38d017fadcd" -> null
      - id               = "rtb-074e9e38d017fadcd" -> null
      - owner_id         = "992382441132" -> null
      - propagating_vgws = [] -> null
      - region           = "us-east-1" -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-0dbe72316e94e12c8"
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "eks-public-route-table"
        } -> null
      - tags_all         = {
          - "Name" = "eks-public-route-table"
        } -> null
      - vpc_id           = "vpc-0dccce2def3e421c1" -> null
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_rt_a will be destroyed
  # (because aws_route_table_association.private_rt_a is not in configuration)
  - resource "aws_route_table_association" "private_rt_a" {
      - id             = "rtbassoc-03aa0dc3e14d0cfd2" -> null
      - region         = "us-east-1" -> null
      - route_table_id = "rtb-0bcfb2d0bb3529d68" -> null
      - subnet_id      = "subnet-0a72ac9c2aeb1965f" -> null
    }

  # aws_route_table_association.private_rt_b will be destroyed
  # (because aws_route_table_association.private_rt_b is not in configuration)
  - resource "aws_route_table_association" "private_rt_b" {
      - id             = "rtbassoc-01d04bfc705bc16b1" -> null
      - region         = "us-east-1" -> null
      - route_table_id = "rtb-0bcfb2d0bb3529d68" -> null
      - subnet_id      = "subnet-08c714e253cccc4d1" -> null
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_rt_a will be destroyed
  # (because aws_route_table_association.public_rt_a is not in configuration)
  - resource "aws_route_table_association" "public_rt_a" {
      - id             = "rtbassoc-0e3a0977f2ae3d9b9" -> null
      - region         = "us-east-1" -> null
      - route_table_id = "rtb-074e9e38d017fadcd" -> null
      - subnet_id      = "subnet-081111dbb9db6661f" -> null
    }

  # aws_route_table_association.public_rt_b will be destroyed
  # (because aws_route_table_association.public_rt_b is not in configuration)
  - resource "aws_route_table_association" "public_rt_b" {
      - id             = "rtbassoc-0208e290fc4311bd6" -> null
      - region         = "us-east-1" -> null
      - route_table_id = "rtb-074e9e38d017fadcd" -> null
      - subnet_id      = "subnet-0b4c8efc990bb9b1f" -> null
    }

  # aws_security_group.bastion will be created
  + resource "aws_security_group" "bastion" {
      + arn                    = (known after apply)
      + description            = "Security group for bastion host"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "my-eks-cluster-bastion-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "my-eks-cluster-bastion-sg"
        }
      + tags_all               = {
          + "Name" = "my-eks-cluster-bastion-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.ec2_sg will be destroyed
  # (because aws_security_group.ec2_sg is not in configuration)
  - resource "aws_security_group" "ec2_sg" {
      - arn                    = "arn:aws:ec2:us-east-1:992382441132:security-group/sg-08174a940d31cd9fc" -> null
      - description            = "Allow SSH and EKS-related ports" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-08174a940d31cd9fc" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "SSH access"
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          - {
              - cidr_blocks      = [
                  - "10.20.1.0/24",
                  - "10.20.2.0/24",
                ]
              - description      = "EKS API server"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "10.20.1.0/24",
                  - "10.20.2.0/24",
                ]
              - description      = "Kubelet API"
              - from_port        = 10250
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 10250
            },
          - {
              - cidr_blocks      = [
                  - "10.20.1.0/24",
                  - "10.20.2.0/24",
                ]
              - description      = "NodePort range"
              - from_port        = 30000
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 32767
            },
        ] -> null
      - name                   = "ec2-eks-sg" -> null
      - owner_id               = "992382441132" -> null
      - region                 = "us-east-1" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "ec2-eks-sg"
        } -> null
      - tags_all               = {
          - "Name" = "ec2-eks-sg"
        } -> null
      - vpc_id                 = "vpc-0dccce2def3e421c1" -> null
    }

  # aws_security_group.eks_cluster must be replaced
-/+ resource "aws_security_group" "eks_cluster" {
      ~ arn                    = "arn:aws:ec2:us-east-1:992382441132:security-group/sg-045ba040e4cb7e4b7" -> (known after apply)
      ~ description            = "Cluster communication with worker nodes" -> "Security group for EKS cluster control plane" # forces replacement
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow cluster API Server to communicate with the worker nodes on API server extension"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-07feb1532b5399ea0",
                ]
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow cluster API Server to communicate with the worker nodes"
              - from_port        = 1024
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-07feb1532b5399ea0",
                ]
              - self             = false
              - to_port          = 65535
            },
        ]
      ~ id                     = "sg-045ba040e4cb7e4b7" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.20.1.0/24",
                ]
              - description      = "Mgmt Server subnet"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow worker nodes to communicate with the cluster API Server"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-07feb1532b5399ea0",
                ]
              - self             = false
              - to_port          = 443
            },
        ] -> (known after apply)
      ~ name                   = "prod-num-mgmt-eks-cluster-sg" -> "my-eks-cluster-cluster-sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "992382441132" -> (known after apply)
      ~ tags                   = {
          ~ "Name"                                            = "mgmt-eks-cluster-sg" -> "my-eks-cluster-cluster-sg"
          - "kubernetes.io/cluster/num-mgmt-prod-eks-cluster" = "owned" -> null
        }
      ~ tags_all               = {
          ~ "Name"                                            = "mgmt-eks-cluster-sg" -> "my-eks-cluster-cluster-sg"
          - "kubernetes.io/cluster/num-mgmt-prod-eks-cluster" = "owned" -> null
        }
      ~ vpc_id                 = "vpc-0dccce2def3e421c1" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_security_group.eks_node will be destroyed
  # (because aws_security_group.eks_node is not in configuration)
  - resource "aws_security_group" "eks_node" {
      - arn                    = "arn:aws:ec2:us-east-1:992382441132:security-group/sg-07feb1532b5399ea0" -> null
      - description            = "Worker nodes SG" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow unrestricted egress for nodes"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow egress from nodes to master"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-045ba040e4cb7e4b7",
                ]
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow unrestricted outbound node 2 node"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = true
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-07feb1532b5399ea0" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow API Server to communicate with kubelet"
              - from_port        = 10250
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-045ba040e4cb7e4b7",
                ]
              - self             = false
              - to_port          = 10250
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow unrestricted inbound node 2 node"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = true
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = "Master to node for webhooks"
              - from_port        = 1024
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-045ba040e4cb7e4b7",
                ]
              - self             = false
              - to_port          = 65535
            },
          - {
              - cidr_blocks      = []
              - description      = "Master to node on api server extension"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-045ba040e4cb7e4b7",
                ]
              - self             = false
              - to_port          = 443
            },
        ] -> null
      - name                   = "prod-num-mgmt-eks-node-sg" -> null
      - owner_id               = "992382441132" -> null
      - region                 = "us-east-1" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "mgmt-eks-node-sg"
        } -> null
      - tags_all               = {
          - "Name" = "mgmt-eks-node-sg"
        } -> null
      - vpc_id                 = "vpc-0dccce2def3e421c1" -> null
    }

  # aws_security_group.eks_nodes will be created
  + resource "aws_security_group" "eks_nodes" {
      + arn                    = (known after apply)
      + description            = "Security group for EKS worker nodes"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 65535
            },
        ]
      + name                   = "my-eks-cluster-node-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "my-eks-cluster-node-sg"
        }
      + tags_all               = {
          + "Name" = "my-eks-cluster-node-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.cluster_inbound will be destroyed
  # (because aws_security_group_rule.cluster_inbound is not in configuration)
  - resource "aws_security_group_rule" "cluster_inbound" {
      - description              = "Allow worker nodes to communicate with the cluster API Server" -> null
      - from_port                = 443 -> null
      - id                       = "sgrule-4216858635" -> null
      - protocol                 = "tcp" -> null
      - region                   = "us-east-1" -> null
      - security_group_id        = "sg-045ba040e4cb7e4b7" -> null
      - security_group_rule_id   = "sgr-0c4155e37839a90bf" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-07feb1532b5399ea0" -> null
      - to_port                  = 443 -> null
      - type                     = "ingress" -> null
    }

  # aws_security_group_rule.cluster_inbound_https will be created
  + resource "aws_security_group_rule" "cluster_inbound_https" {
      + description              = "Allow worker nodes to communicate with cluster API Server"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-east-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.cluster_inbound_subnet will be destroyed
  # (because aws_security_group_rule.cluster_inbound_subnet is not in configuration)
  - resource "aws_security_group_rule" "cluster_inbound_subnet" {
      - cidr_blocks            = [
          - "10.20.1.0/24",
        ] -> null
      - description            = "Mgmt Server subnet" -> null
      - from_port              = 443 -> null
      - id                     = "sgrule-3343027942" -> null
      - protocol               = "tcp" -> null
      - region                 = "us-east-1" -> null
      - security_group_id      = "sg-045ba040e4cb7e4b7" -> null
      - security_group_rule_id = "sgr-00dd9068b15bfcfb6" -> null
      - self                   = false -> null
      - to_port                = 443 -> null
      - type                   = "ingress" -> null
    }

  # aws_security_group_rule.cluster_outbound will be destroyed
  # (because aws_security_group_rule.cluster_outbound is not in configuration)
  - resource "aws_security_group_rule" "cluster_outbound" {
      - description              = "Allow cluster API Server to communicate with the worker nodes" -> null
      - from_port                = 1024 -> null
      - id                       = "sgrule-2951571548" -> null
      - protocol                 = "tcp" -> null
      - region                   = "us-east-1" -> null
      - security_group_id        = "sg-045ba040e4cb7e4b7" -> null
      - security_group_rule_id   = "sgr-0e4617f0805521656" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-07feb1532b5399ea0" -> null
      - to_port                  = 65535 -> null
      - type                     = "egress" -> null
    }

  # aws_security_group_rule.cluster_outbound_node will be destroyed
  # (because aws_security_group_rule.cluster_outbound_node is not in configuration)
  - resource "aws_security_group_rule" "cluster_outbound_node" {
      - description              = "Allow cluster API Server to communicate with the worker nodes on API server extension" -> null
      - from_port                = 443 -> null
      - id                       = "sgrule-1048970231" -> null
      - protocol                 = "tcp" -> null
      - region                   = "us-east-1" -> null
      - security_group_id        = "sg-045ba040e4cb7e4b7" -> null
      - security_group_rule_id   = "sgr-071e5d7eaed79002f" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-07feb1532b5399ea0" -> null
      - to_port                  = 443 -> null
      - type                     = "egress" -> null
    }

  # aws_security_group_rule.node_inbound_master will be destroyed
  # (because aws_security_group_rule.node_inbound_master is not in configuration)
  - resource "aws_security_group_rule" "node_inbound_master" {
      - description              = "Allow API Server to communicate with kubelet" -> null
      - from_port                = 10250 -> null
      - id                       = "sgrule-4062072762" -> null
      - protocol                 = "tcp" -> null
      - region                   = "us-east-1" -> null
      - security_group_id        = "sg-07feb1532b5399ea0" -> null
      - security_group_rule_id   = "sgr-04caa50c00bbe04c5" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-045ba040e4cb7e4b7" -> null
      - to_port                  = 10250 -> null
      - type                     = "ingress" -> null
    }

  # aws_security_group_rule.node_inbound_node will be destroyed
  # (because aws_security_group_rule.node_inbound_node is not in configuration)
  - resource "aws_security_group_rule" "node_inbound_node" {
      - description              = "Allow unrestricted inbound node 2 node" -> null
      - from_port                = 0 -> null
      - id                       = "sgrule-1032294380" -> null
      - protocol                 = "-1" -> null
      - region                   = "us-east-1" -> null
      - security_group_id        = "sg-07feb1532b5399ea0" -> null
      - security_group_rule_id   = "sgr-03b0021573fc00163" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-07feb1532b5399ea0" -> null
      - to_port                  = 0 -> null
      - type                     = "ingress" -> null
    }

  # aws_security_group_rule.node_inbound_node_extension will be destroyed
  # (because aws_security_group_rule.node_inbound_node_extension is not in configuration)
  - resource "aws_security_group_rule" "node_inbound_node_extension" {
      - description              = "Master to node on api server extension" -> null
      - from_port                = 443 -> null
      - id                       = "sgrule-192312478" -> null
      - protocol                 = "tcp" -> null
      - region                   = "us-east-1" -> null
      - security_group_id        = "sg-07feb1532b5399ea0" -> null
      - security_group_rule_id   = "sgr-05c5aa26321920316" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-045ba040e4cb7e4b7" -> null
      - to_port                  = 443 -> null
      - type                     = "ingress" -> null
    }

  # aws_security_group_rule.node_inbound_webhooks will be destroyed
  # (because aws_security_group_rule.node_inbound_webhooks is not in configuration)
  - resource "aws_security_group_rule" "node_inbound_webhooks" {
      - description              = "Master to node for webhooks" -> null
      - from_port                = 1024 -> null
      - id                       = "sgrule-3228027420" -> null
      - protocol                 = "tcp" -> null
      - region                   = "us-east-1" -> null
      - security_group_id        = "sg-07feb1532b5399ea0" -> null
      - security_group_rule_id   = "sgr-02b11ea4f6e273e57" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-045ba040e4cb7e4b7" -> null
      - to_port                  = 65535 -> null
      - type                     = "ingress" -> null
    }

  # aws_security_group_rule.node_outbound_internet will be destroyed
  # (because aws_security_group_rule.node_outbound_internet is not in configuration)
  - resource "aws_security_group_rule" "node_outbound_internet" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "Allow unrestricted egress for nodes" -> null
      - from_port              = 0 -> null
      - id                     = "sgrule-533721454" -> null
      - protocol               = "-1" -> null
      - region                 = "us-east-1" -> null
      - security_group_id      = "sg-07feb1532b5399ea0" -> null
      - security_group_rule_id = "sgr-0fc4462dab8375913" -> null
      - self                   = false -> null
      - to_port                = 0 -> null
      - type                   = "egress" -> null
    }

  # aws_security_group_rule.node_outbound_master will be destroyed
  # (because aws_security_group_rule.node_outbound_master is not in configuration)
  - resource "aws_security_group_rule" "node_outbound_master" {
      - description              = "Allow egress from nodes to master" -> null
      - from_port                = 443 -> null
      - id                       = "sgrule-1291749790" -> null
      - protocol                 = "tcp" -> null
      - region                   = "us-east-1" -> null
      - security_group_id        = "sg-07feb1532b5399ea0" -> null
      - security_group_rule_id   = "sgr-05c5aa26321920316" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-045ba040e4cb7e4b7" -> null
      - to_port                  = 443 -> null
      - type                     = "egress" -> null
    }

  # aws_security_group_rule.node_outbound_node will be destroyed
  # (because aws_security_group_rule.node_outbound_node is not in configuration)
  - resource "aws_security_group_rule" "node_outbound_node" {
      - description              = "Allow unrestricted outbound node 2 node" -> null
      - from_port                = 0 -> null
      - id                       = "sgrule-3992475341" -> null
      - protocol                 = "-1" -> null
      - region                   = "us-east-1" -> null
      - security_group_id        = "sg-07feb1532b5399ea0" -> null
      - security_group_rule_id   = "sgr-0a989c5eea696813e" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-07feb1532b5399ea0" -> null
      - to_port                  = 0 -> null
      - type                     = "egress" -> null
    }

  # aws_security_group_rule.nodes_inbound_cluster_kubelet will be created
  + resource "aws_security_group_rule" "nodes_inbound_cluster_kubelet" {
      + description              = "Allow cluster control plane to communicate with kubelet"
      + from_port                = 10250
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-east-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # aws_security_group_rule.nodes_outbound_cluster_https will be created
  + resource "aws_security_group_rule" "nodes_outbound_cluster_https" {
      + description              = "Allow pods to communicate with the cluster API Server"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-east-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Name"                                 = "my-eks-cluster-private-subnet-1"
          + "Type"                                 = "Private"
          + "kubernetes.io/cluster/my-eks-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"      = "1"
        }
      + tags_all                                       = {
          + "Name"                                 = "my-eks-cluster-private-subnet-1"
          + "Type"                                 = "Private"
          + "kubernetes.io/cluster/my-eks-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"      = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.48.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Name"                                 = "my-eks-cluster-private-subnet-2"
          + "Type"                                 = "Private"
          + "kubernetes.io/cluster/my-eks-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"      = "1"
        }
      + tags_all                                       = {
          + "Name"                                 = "my-eks-cluster-private-subnet-2"
          + "Type"                                 = "Private"
          + "kubernetes.io/cluster/my-eks-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"      = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private_subnet_a will be destroyed
  # (because aws_subnet.private_subnet_a is not in configuration)
  - resource "aws_subnet" "private_subnet_a" {
      - arn                                            = "arn:aws:ec2:us-east-1:992382441132:subnet/subnet-0a72ac9c2aeb1965f" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az1" -> null
      - cidr_block                                     = "10.20.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0a72ac9c2aeb1965f" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "992382441132" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - region                                         = "us-east-1" -> null
      - tags                                           = {
          - "Name"                                            = "eks-private-a"
          - "kubernetes.io/cluster/num-mgmt-prod-eks-cluster" = "shared"
          - "kubernetes.io/role/internal-elb"                 = "1"
        } -> null
      - tags_all                                       = {
          - "Name"                                            = "eks-private-a"
          - "kubernetes.io/cluster/num-mgmt-prod-eks-cluster" = "shared"
          - "kubernetes.io/role/internal-elb"                 = "1"
        } -> null
      - vpc_id                                         = "vpc-0dccce2def3e421c1" -> null
    }

  # aws_subnet.private_subnet_b will be destroyed
  # (because aws_subnet.private_subnet_b is not in configuration)
  - resource "aws_subnet" "private_subnet_b" {
      - arn                                            = "arn:aws:ec2:us-east-1:992382441132:subnet/subnet-08c714e253cccc4d1" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az2" -> null
      - cidr_block                                     = "10.20.2.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-08c714e253cccc4d1" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "992382441132" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - region                                         = "us-east-1" -> null
      - tags                                           = {
          - "Name"                                            = "eks-private-b"
          - "kubernetes.io/cluster/num-mgmt-prod-eks-cluster" = "shared"
          - "kubernetes.io/role/internal-elb"                 = "1"
        } -> null
      - tags_all                                       = {
          - "Name"                                            = "eks-private-b"
          - "kubernetes.io/cluster/num-mgmt-prod-eks-cluster" = "shared"
          - "kubernetes.io/role/internal-elb"                 = "1"
        } -> null
      - vpc_id                                         = "vpc-0dccce2def3e421c1" -> null
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Name"                                 = "my-eks-cluster-public-subnet-1"
          + "Type"                                 = "Public"
          + "kubernetes.io/cluster/my-eks-cluster" = "shared"
          + "kubernetes.io/role/elb"               = "1"
        }
      + tags_all                                       = {
          + "Name"                                 = "my-eks-cluster-public-subnet-1"
          + "Type"                                 = "Public"
          + "kubernetes.io/cluster/my-eks-cluster" = "shared"
          + "kubernetes.io/role/elb"               = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Name"                                 = "my-eks-cluster-public-subnet-2"
          + "Type"                                 = "Public"
          + "kubernetes.io/cluster/my-eks-cluster" = "shared"
          + "kubernetes.io/role/elb"               = "1"
        }
      + tags_all                                       = {
          + "Name"                                 = "my-eks-cluster-public-subnet-2"
          + "Type"                                 = "Public"
          + "kubernetes.io/cluster/my-eks-cluster" = "shared"
          + "kubernetes.io/role/elb"               = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public_subnet_a will be destroyed
  # (because aws_subnet.public_subnet_a is not in configuration)
  - resource "aws_subnet" "public_subnet_a" {
      - arn                                            = "arn:aws:ec2:us-east-1:992382441132:subnet/subnet-081111dbb9db6661f" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az1" -> null
      - cidr_block                                     = "10.20.3.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-081111dbb9db6661f" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "992382441132" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - region                                         = "us-east-1" -> null
      - tags                                           = {
          - "Name" = "eks-public-a"
        } -> null
      - tags_all                                       = {
          - "Name" = "eks-public-a"
        } -> null
      - vpc_id                                         = "vpc-0dccce2def3e421c1" -> null
    }

  # aws_subnet.public_subnet_b will be destroyed
  # (because aws_subnet.public_subnet_b is not in configuration)
  - resource "aws_subnet" "public_subnet_b" {
      - arn                                            = "arn:aws:ec2:us-east-1:992382441132:subnet/subnet-0b4c8efc990bb9b1f" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az2" -> null
      - cidr_block                                     = "10.20.4.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0b4c8efc990bb9b1f" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "992382441132" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - region                                         = "us-east-1" -> null
      - tags                                           = {
          - "Name" = "eks-public-b"
        } -> null
      - tags_all                                       = {
          - "Name" = "eks-public-b"
        } -> null
      - vpc_id                                         = "vpc-0dccce2def3e421c1" -> null
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "us-east-1"
      + tags                                 = {
          + "Name"                                 = "my-eks-cluster-vpc"
          + "kubernetes.io/cluster/my-eks-cluster" = "shared"
        }
      + tags_all                             = {
          + "Name"                                 = "my-eks-cluster-vpc"
          + "kubernetes.io/cluster/my-eks-cluster" = "shared"
        }
    }

  # aws_vpc.vpc will be destroyed
  # (because aws_vpc.vpc is not in configuration)
  - resource "aws_vpc" "vpc" {
      - arn                                  = "arn:aws:ec2:us-east-1:992382441132:vpc/vpc-0dccce2def3e421c1" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.20.0.0/16" -> null
      - default_network_acl_id               = "acl-0d4ec9824bf654c29" -> null
      - default_route_table_id               = "rtb-06ff58a735f1dd59f" -> null
      - default_security_group_id            = "sg-0ad4b09db077ffae0" -> null
      - dhcp_options_id                      = "dopt-040ed0f89cbadcd5d" -> null
      - enable_dns_hostnames                 = true -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-0dccce2def3e421c1" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-06ff58a735f1dd59f" -> null
      - owner_id                             = "992382441132" -> null
      - region                               = "us-east-1" -> null
      - tags                                 = {
          - "Name" = "EKS-Demo"
        } -> null
      - tags_all                             = {
          - "Name" = "EKS-Demo"
        } -> null
    }

Plan: 40 to add, 1 to change, 54 to destroy.

Changes to Outputs:
  + bastion_instance_id                = (known after apply)
  + bastion_public_ip                  = (known after apply)
  + bastion_role_arn                   = (known after apply)
  + cluster_arn                        = (known after apply)
  + cluster_certificate_authority_data = (known after apply)
  + cluster_endpoint                   = (known after apply)
  + cluster_name                       = "my-eks-cluster"
  + cluster_oidc_issuer_url            = (known after apply)
  + cluster_role_arn                   = (known after apply)
  + cluster_security_group_id          = (known after apply)
  + ecr_repository_url                 = (known after apply)
  - eks_cluster_id                     = "mgmt-eks-cluster" -> null
  + node_group_arn                     = (known after apply)
  + node_role_arn                      = (known after apply)
  + private_subnet_ids                 = [
      + (known after apply),
      + (known after apply),
    ]
  + public_subnet_ids                  = [
      + (known after apply),
      + (known after apply),
    ]
  + vpc_id                             = (known after apply)

Warning: Value is base64 encoded

  with aws_instance.bastion,
  on eks.tf line 505, in resource "aws_instance" "bastion":
 505:   user_data = base64encode(templatefile("${path.module}/bastion_userdata.sh", {
 506:     cluster_name = var.cluster_name
 507:     region       = var.region
 508:   }))

The value is base64 encoded. If you want to use base64 encoding, please use
the user_data_base64 argument. user_data attribute is set as cleartext in
state

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @anuragrai63, Action: `pull_request`*